source/_static/diagrams/17-patches.d2
direction: right
n0: "tarball"
n1: "patch -pN"
n2: "tree"
n0 -> n1
n1 -> n2
